app/channels/messages_channel.rb

  def speak(data)
    room = Room.default_room
    message = Message.create!(
      content: data['message'],
      username: data['username'],
      room: room
    )
---
INSERT INTO "messages" ("content", "username", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["content", "Olá"], ["username", "JOnathan"], ["created_at", "2025-09-09 20:14:39.899251"], ["updated_at", "2025-09-09 20:14:39.899251"]]