app/channels/typing_channel.rb

  def unsubscribed
    username = params[:username]
    room = Room.find(params[:room_id] || Room.default_room.id)
    # Stop typing when user disconnects
    User.find_by(username: username)&.stop_typing!
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Fabricia"], ["LIMIT", 1]]