app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" ORDER BY "messages"."created_at" ASC LIMIT ?  [["LIMIT", 50]]
---
  def chat
    @room = Room.default_room
    @messages = @room.messages.recent.limit(50)