app/models/user.rb

UPDATE "users" SET "last_seen_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_seen_at", "2025-09-09 20:29:53.610785"], ["updated_at", "2025-09-09 20:29:53.611633"], ["id", 1]]
---
  def self.mark_user_online(username)
    user = find_or_create_by(username: username)
    user.update(is_online: true)

UPDATE "users" SET "last_seen_at" = ?, "is_typing" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_seen_at", "2025-09-09 20:30:13.788739"], ["is_typing", 1], ["updated_at", "2025-09-09 20:30:13.789922"], ["id", 1]]
---
  def self.mark_user_offline(username)
    user = find_by(username: username)
    if user
      user.update(is_online: false)

SELECT "users"."username" FROM "users" WHERE (last_seen_at > ?) ORDER BY "users"."username" ASC  [[nil, "2025-09-09 20:29:23.612612"]]
---
  def self.get_online_users
    online.order(:username).pluck(:username)